In [1]:
import numpy as np
import pandas as pd
import matplotlib

In [2]:
df = pd.DataFrame(np.random.randn(6,4),columns =list('ABCD'))

In [3]:
df

          A         B         C         D
0 -0.729853  0.912608 -0.827546 -1.173451
1 -0.868987 -1.504006 -0.003342  0.716035
2 -0.463207 -0.996297  0.979402  0.098072
3  0.687898 -0.698021 -0.037033  0.108145
4 -1.654391  1.804654 -0.638440  1.076615
5 -0.348462  1.044033  0.702268  1.220402

In [4]:
df['B'].value_counts()

 0.912608    1
 1.044033    1
-0.698021    1
-1.504006    1
 1.804654    1
-0.996297    1
Name: B, dtype: int64

In [5]:
df.loc[2].value_counts()

-0.463207    1
 0.098072    1
 0.979402    1
-0.996297    1
Name: 2, dtype: int64

In [6]:
df['C'].nunique()

6

In [7]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.562833  0.093828  0.029218  0.340970
std    0.765942  1.331817  0.712896  0.878855
min   -1.654391 -1.504006 -0.827546 -1.173451
25%   -0.834204 -0.921728 -0.488088  0.100590
50%   -0.596530  0.107293 -0.020187  0.412090
75%   -0.377148  1.011176  0.525866  0.986470
max    0.687898  1.804654  0.979402  1.220402

In [8]:
df.sum(axis = 1)

0   -1.818242
1   -1.660300
2   -0.382030
3    0.060989
4    0.588438
5    2.618242
dtype: float64

In [9]:
df.min()

A   -1.654391
B   -1.504006
C   -0.827546
D   -1.173451
dtype: float64

In [10]:
df.min(axis = 1)

0   -1.173451
1   -1.504006
2   -0.996297
3   -0.698021
4   -1.654391
5   -0.348462
dtype: float64

In [11]:
df.count()

A    6
B    6
C    6
D    6
dtype: int64

In [12]:
df.count(axis = 1
        )

0    4
1    4
2    4
3    4
4    4
5    4
dtype: int64

In [13]:
df.median()

A   -0.596530
B    0.107293
C   -0.020187
D    0.412090
dtype: float64

In [14]:
df.median(axis = 1)

0   -0.778699
1   -0.436165
2   -0.182567
3    0.035556
4    0.219088
5    0.873150
dtype: float64

In [15]:
df.quantile()

A   -0.596530
B    0.107293
C   -0.020187
D    0.412090
Name: 0.5, dtype: float64

In [16]:
df.quantile(axis = 1)

0   -0.778699
1   -0.436165
2   -0.182567
3    0.035556
4    0.219088
5    0.873150
Name: 0.5, dtype: float64

In [17]:
df.apply(lambda x:x**2)

          A         B         C         D
0  0.532685  0.832853  0.684833  1.376987
1  0.755139  2.262034  0.000011  0.512706
2  0.214560  0.992609  0.959227  0.009618
3  0.473204  0.487233  0.001371  0.011695
4  2.737009  3.256776  0.407605  1.159100
5  0.121426  1.090004  0.493181  1.489382

In [18]:
df.A[2] = np.nan

In [19]:
df

          A         B         C         D
0 -0.729853  0.912608 -0.827546 -1.173451
1 -0.868987 -1.504006 -0.003342  0.716035
2       NaN -0.996297  0.979402  0.098072
3  0.687898 -0.698021 -0.037033  0.108145
4 -1.654391  1.804654 -0.638440  1.076615
5 -0.348462  1.044033  0.702268  1.220402

In [20]:
df.dropna()

          A         B         C         D
0 -0.729853  0.912608 -0.827546 -1.173451
1 -0.868987 -1.504006 -0.003342  0.716035
3  0.687898 -0.698021 -0.037033  0.108145
4 -1.654391  1.804654 -0.638440  1.076615
5 -0.348462  1.044033  0.702268  1.220402

In [21]:
df.fillna(value = 12)

           A         B         C         D
0  -0.729853  0.912608 -0.827546 -1.173451
1  -0.868987 -1.504006 -0.003342  0.716035
2  12.000000 -0.996297  0.979402  0.098072
3   0.687898 -0.698021 -0.037033  0.108145
4  -1.654391  1.804654 -0.638440  1.076615
5  -0.348462  1.044033  0.702268  1.220402

In [22]:
#df.assign(A = lambda x:x+10 df.B = lambda y:y+100)

In [23]:
df

          A         B         C         D
0 -0.729853  0.912608 -0.827546 -1.173451
1 -0.868987 -1.504006 -0.003342  0.716035
2       NaN -0.996297  0.979402  0.098072
3  0.687898 -0.698021 -0.037033  0.108145
4 -1.654391  1.804654 -0.638440  1.076615
5 -0.348462  1.044033  0.702268  1.220402

In [24]:
df.groupby(level = 0)

In [25]:
list(df.groupby(level = 0))

[(0,           A         B         C         D
  0 -0.729853  0.912608 -0.827546 -1.173451),
 (1,           A         B         C         D
  1 -0.868987 -1.504006 -0.003342  0.716035),
 (2,     A         B         C         D
  2 NaN -0.996297  0.979402  0.098072),
 (3,           A         B         C         D
  3  0.687898 -0.698021 -0.037033  0.108145),
 (4,           A         B        C         D
  4 -1.654391  1.804654 -0.63844  1.076615),
 (5,           A         B         C         D
  5 -0.348462  1.044033  0.702268  1.220402)]

In [26]:
df.groupby(by = 'A')

In [27]:
list(df.groupby(by = 'A'))

[(-1.6543907388491386,           A         B        C         D
  4 -1.654391  1.804654 -0.63844  1.076615),
 (-0.8689872936759615,           A         B         C         D
  1 -0.868987 -1.504006 -0.003342  0.716035),
 (-0.7298526784297795,           A         B         C         D
  0 -0.729853  0.912608 -0.827546 -1.173451),
 (-0.34846164912253597,           A         B         C         D
  5 -0.348462  1.044033  0.702268  1.220402),
 (0.6878982130183523,           A         B         C         D
  3  0.687898 -0.698021 -0.037033  0.108145)]

In [28]:
df

          A         B         C         D
0 -0.729853  0.912608 -0.827546 -1.173451
1 -0.868987 -1.504006 -0.003342  0.716035
2       NaN -0.996297  0.979402  0.098072
3  0.687898 -0.698021 -0.037033  0.108145
4 -1.654391  1.804654 -0.638440  1.076615
5 -0.348462  1.044033  0.702268  1.220402

In [29]:
a = df.groupby(by = ['A','B']).sum()

In [30]:
a

                            C         D
A         B
-1.654391  1.804654 -0.638440  1.076615
-0.868987 -1.504006 -0.003342  0.716035
-0.729853  0.912608 -0.827546 -1.173451
-0.348462  1.044033  0.702268  1.220402
 0.687898 -0.698021 -0.037033  0.108145

In [31]:
a.index

MultiIndex(levels=[[-1.6543907388491386, -0.8689872936759615, -0.7298526784297795, -0.34846164912253597, 0.6878982130183523], [-1.5040059185587644, -0.9962974490450277, -0.6980209005336347, 0.9126077226470223, 1.0440326040707568, 1.8046538491619477]],
           labels=[[0, 1, 2, 3, 4], [5, 0, 3, 4, 2]],
           names=['A', 'B'])

In [32]:
a.index.levels[1]

Float64Index([-1.5040059185587644, -0.9962974490450277, -0.6980209005336347,
               0.9126077226470223,  1.0440326040707568,  1.8046538491619477],
             dtype='float64', name='B')

In [33]:
obj = pd.Series([7,-5,7,4,2,0,4,8,8])

In [34]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
7    8
8    8
dtype: int64

In [35]:
obj.rank(method = 'max')

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
7    9.0
8    9.0
dtype: float64

In [36]:
df = pd.DataFrame({'class':['人工智能','H5','大数据','大数据','人工智能','H5'],
                   'name':['bob','shy','张三','李四','老王','老李'],
                  'score':[98,92,80,59,60,100],
                  'age':[21,23,24,26,19,20]})

In [37]:
df

  class name  score  age
0  人工智能  bob     98   21
1    H5  shy     92   23
2   大数据   张三     80   24
3   大数据   李四     59   26
4  人工智能   老王     60   19
5    H5   老李    100   20

In [38]:
df.groupby(by = 'class').groups

{'H5': Int64Index([1, 5], dtype='int64'),
 '人工智能': Int64Index([0, 4], dtype='int64'),
 '大数据': Int64Index([2, 3], dtype='int64')}

In [39]:
list(df.groupby(by = 'class'))

[('H5',   class name  score  age
  1    H5  shy     92   23
  5    H5   老李    100   20), ('人工智能',   class name  score  age
  0  人工智能  bob     98   21
  4  人工智能   老王     60   19), ('大数据',   class name  score  age
  2   大数据   张三     80   24
  3   大数据   李四     59   26)]

In [40]:
df1 = df.groupby(by = ['class','name']).sum()

In [41]:
df1

            score  age
class name
H5    shy      92   23
      老李      100   20
人工智能  bob      98   21
      老王       60   19
大数据   张三       80   24
      李四       59   26

In [42]:
df1.groupby(level = 0).groups

{'H5': MultiIndex(levels=[['H5', '人工智能', '大数据'], ['bob', 'shy', '张三', '李四', '老李', '老王']],
            labels=[[0, 0], [1, 4]],
            names=['class', 'name']),
 '人工智能': MultiIndex(levels=[['H5', '人工智能', '大数据'], ['bob', 'shy', '张三', '李四', '老李', '老王']],
            labels=[[1, 1], [0, 5]],
            names=['class', 'name']),
 '大数据': MultiIndex(levels=[['H5', '人工智能', '大数据'], ['bob', 'shy', '张三', '李四', '老李', '老王']],
            labels=[[2, 2], [2, 3]],
            names=['class', 'name'])}

In [43]:
list(df1.groupby(level = 0))

[('H5',             score  age
  class name
  H5    shy      92   23
        老李      100   20), ('人工智能',             score  age
  class name
  人工智能  bob      98   21
        老王       60   19), ('大数据',             score  age
  class name
  大数据   张三       80   24
        李四       59   26)]

In [44]:
df1.index

MultiIndex(levels=[['H5', '人工智能', '大数据'], ['bob', 'shy', '张三', '李四', '老李', '老王']],
           labels=[[0, 0, 1, 1, 2, 2], [1, 4, 0, 5, 2, 3]],
           names=['class', 'name'])

In [45]:
df.groupby(by = 'age').max()

    class name  score
age
19   人工智能   老王     60
20     H5   老李    100
21   人工智能  bob     98
23     H5  shy     92
24    大数据   张三     80
26    大数据   李四     59

In [46]:
df.groupby(by = 'age').min()

    class name  score
age
19   人工智能   老王     60
20     H5   老李    100
21   人工智能  bob     98
23     H5  shy     92
24    大数据   张三     80
26    大数据   李四     59

In [47]:
df.groupby(by = 'class').agg('max')

      name  score  age
class
H5      老李    100   23
人工智能    老王     98   21
大数据     李四     80   26

In [48]:
df.groupby(by = 'class').agg('min')

      name  score  age
class
H5     shy     92   20
人工智能   bob     60   19
大数据     张三     59   24

In [49]:
df.groupby(by = 'class').agg('mean')

       score   age
class
H5      96.0  21.5
人工智能    79.0  20.0
大数据     69.5  25.0

In [50]:
df.groupby(by = 'name').shift(1)

  class  score  age
0   NaN    NaN  NaN
1   NaN    NaN  NaN
2   NaN    NaN  NaN
3   NaN    NaN  NaN
4   NaN    NaN  NaN
5   NaN    NaN  NaN

In [51]:
df

  class name  score  age
0  人工智能  bob     98   21
1    H5  shy     92   23
2   大数据   张三     80   24
3   大数据   李四     59   26
4  人工智能   老王     60   19
5    H5   老李    100   20

In [52]:
df.groupby(by = 'class').shift(1)

  name  score   age
0  NaN    NaN   NaN
1  NaN    NaN   NaN
2  NaN    NaN   NaN
3   张三   80.0  24.0
4  bob   98.0  21.0
5  shy   92.0  23.0

In [53]:
df.rank(method = 'dense')

   class  name  score  age
0    2.0   1.0    5.0  3.0
1    1.0   2.0    4.0  4.0
2    3.0   3.0    3.0  5.0
3    3.0   4.0    1.0  6.0
4    2.0   6.0    2.0  1.0
5    1.0   5.0    6.0  2.0

In [54]:
df

  class name  score  age
0  人工智能  bob     98   21
1    H5  shy     92   23
2   大数据   张三     80   24
3   大数据   李四     59   26
4  人工智能   老王     60   19
5    H5   老李    100   20

In [55]:
df1.rank(method = 'dense')

            score  age
class name
H5    shy     4.0  4.0
      老李      6.0  2.0
人工智能  bob     5.0  3.0
      老王      2.0  1.0
大数据   张三      3.0  5.0
      李四      1.0  6.0

In [56]:
df1

            score  age
class name
H5    shy      92   23
      老李      100   20
人工智能  bob      98   21
      老王       60   19
大数据   张三       80   24
      李四       59   26

In [57]:
df1.rank(method = 'min',ascending = False)

            score  age
class name
H5    shy     3.0  3.0
      老李      1.0  5.0
人工智能  bob     2.0  4.0
      老王      5.0  6.0
大数据   张三      4.0  2.0
      李四      6.0  1.0

In [58]:
df1.rank(method = 'first',ascending = False)

            score  age
class name
H5    shy     3.0  3.0
      老李      1.0  5.0
人工智能  bob     2.0  4.0
      老王      5.0  6.0
大数据   张三      4.0  2.0
      李四      6.0  1.0

In [59]:
df1

            score  age
class name
H5    shy      92   23
      老李      100   20
人工智能  bob      98   21
      老王       60   19
大数据   张三       80   24
      李四       59   26

In [60]:
df1.rank(method = 'min')

            score  age
class name
H5    shy     4.0  4.0
      老李      6.0  2.0
人工智能  bob     5.0  3.0
      老王      2.0  1.0
大数据   张三      3.0  5.0
      李四      1.0  6.0

In [61]:
df

  class name  score  age
0  人工智能  bob     98   21
1    H5  shy     92   23
2   大数据   张三     80   24
3   大数据   李四     59   26
4  人工智能   老王     60   19
5    H5   老李    100   20

In [62]:
df.groupby(by = 'class').cummax()

   score  age
0     98   21
1     92   23
2     80   24
3     80   26
4     98   21
5    100   23

In [63]:
df.cummax()

  class name score age
0  人工智能  bob    98  21
1  人工智能  shy    98  23
2   大数据   张三    98  24
3   大数据   李四    98  26
4   大数据   老王    98  26
5   大数据   老王   100  26

In [64]:
df.cummin()

  class name score age
0  人工智能  bob    98  21
1    H5  bob    92  21
2    H5  bob    80  21
3    H5  bob    59  21
4    H5  bob    59  19
5    H5  bob    59  19

In [65]:
df

  class name  score  age
0  人工智能  bob     98   21
1    H5  shy     92   23
2   大数据   张三     80   24
3   大数据   李四     59   26
4  人工智能   老王     60   19
5    H5   老李    100   20

In [66]:
df

  class name  score  age
0  人工智能  bob     98   21
1    H5  shy     92   23
2   大数据   张三     80   24
3   大数据   李四     59   26
4  人工智能   老王     60   19
5    H5   老李    100   20

In [67]:
a = pd.DataFrame(np.random.randint(10,50,(2,5)),index = list('ab'),columns = list('ABCDE'))

In [68]:
a

    A   B   C   D   E
a  20  36  45  17  45
b  34  10  47  32  32

In [69]:
b = pd.DataFrame(np.random.randint(10,50,(2,5)),index = list('ac'),columns = list('ABCFG'))

In [70]:
b

    A   B   C   F   G
a  32  19  17  30  42
c  10  43  26  11  19

In [71]:
pd.merge(a,b,how = 'left',on = 'A')

    A  B_x  C_x   D   E  B_y  C_y   F   G
0  20   36   45  17  45  NaN  NaN NaN NaN
1  34   10   47  32  32  NaN  NaN NaN NaN

In [72]:
pd.merge(a,b,on = 'A',how = 'right')

    A  B_x  C_x   D   E  B_y  C_y   F   G
0  32  NaN  NaN NaN NaN   19   17  30  42
1  10  NaN  NaN NaN NaN   43   26  11  19

In [73]:
a[a.A.isin(b.A)]

Empty DataFrame
Columns: [A, B, C, D, E]
Index: []

In [74]:
a[~a.A.isin(b.A)]

    A   B   C   D   E
a  20  36  45  17  45
b  34  10  47  32  32

In [75]:
a

    A   B   C   D   E
a  20  36  45  17  45
b  34  10  47  32  32

In [76]:
b

    A   B   C   F   G
a  32  19  17  30  42
c  10  43  26  11  19

In [77]:
import numpy as np
import pandas as pd

In [78]:
df = pd.DataFrame(np.arange(0,20).reshape(4,5),index = list('abcd'),columns = list('ABCDE'))

In [79]:
df

    A   B   C   D   E
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19

In [82]:
location = r'C:\Users\16677\Desktop\数据分析练习\班级账号.xlsx'

In [83]:
df = pd.read_excel(location,index = None)

FileNotFoundError: [Errno 2] No such file or directory: 'C:\\Users\\16677\\Desktop\\数据分析练习\\班级账号.xlsx'

In [ ]:
locat = r'C:\Users\16677\Desktop\名单.xlsx'

In [ ]:
df1 = pd.read_excel(locat,names = ['姓名','Github账号','Gitee账号','coding.net账号'],header = None)

In [ ]:
df1

In [ ]:
df

In [ ]:
df1[~df1.姓名.isin(df.姓名)]

## 读取u.user文件

In [ ]:
location1 = r'C:\Users\16677\Desktop\u.user'

In [ ]:
a = pd.read_csv(location1)

In [ ]:
a.head()

In [ ]:
c = a.columns

In [ ]:
c[0]

In [ ]:
df3 = a['user_id|age|gender|occupation|zip_code'].str.split('|',expand = True)

In [ ]:
df3.columns = ['user_id','age','gender','occupation','zip_code']

In [ ]:
df3.head()

In [ ]:
count = df3['occupation'].value_counts()

## 女性和男性那个人多

In [ ]:
count.head(1)

In [ ]:
gender_count = df3['gender'].value_counts()

In [ ]:
gender_count

## 女性中最受欢迎的职业

In [ ]:
df3[gender_count.index[1] == df3['gender']]['occupation'].value_counts()

In [ ]:
b = df3.groupby(by = 'gender')

In [ ]:
b

## 男女中最多的认数

In [ ]:
gender_count.head(1)

## 有没有人来自同一地区？

In [ ]:
len(df3.zip_code)

In [ ]:
len(df3.zip_code.unique())

In [ ]:
t = df3.groupby('zip_code')
for i,x in t:
    #print((i,len(x) ==2))
    if len(x)  == 2:
        print((i,x))

In [ ]:
index1 = df3.groupby('zip_code')['user_id']

In [ ]:
ss = df3.zip_code.value_counts()

In [ ]:
ss.values

In [ ]:
df3[df3['zip_code'].isin(ss[ss.values>1].index)]

In [ ]:
dd = df3.groupby(['zip_code','user_id']).sum()

In [ ]:
list(dd)

In [ ]:
dd.index

In [ ]:
dd.loc['00000']

In [ ]:
dd.apply(lambda x:len(dd.loc[x]>1))

## 谁能告诉我这个数据说明了点啥

1、他们有来自不同地区
2、最受欢迎的职业是学生
3、这个数据集中男的最多

In [ ]:
location2 = r'C:\Users\16677\Desktop\bikes.csv'

In [ ]:
bikes_info = pd.read_csv(location2,encoding = 'ISO-8859-1',sep = ';')

In [ ]:
bikes_info